[
     {
      "blogTitle": "We wish you a happy Eid Mubarak! 🎉",
      "imageHeader":
          "https://typeset-beta.imgix.net/2017/5/12/6a6a3d7d-e1a9-406d-9488-e0b3e5720712.jpg?w=700&h=394&fit=crop&crop=faces&auto=format&q=70",
      "author": "MusliMatch Team",
      "postDate": "4 July 2022",
      "blogP1": "Eid al-Adha is the second and the bigger of the two main holidays celebrated in Islam (the other being Eid al-Fitr). It honors the willingness of Ibrahim to sacrifice his son Ismail as an act of obedience to Allah's command. Before Ibrahim could sacrifice his son, however, Allah provided him with a lamb which he was supposed to kill in his son's place because of his willingness to sacrifice his own son in the name of God. In commemoration of this intervention, animals are ritually slaughtered and sacrificed. Part of their meat is consumed by the family which offers the animal, while the rest of the meat is distributed to the poor and the needy. Sweets and gifts are given, and extended family members are typically visited and welcomed.",
      "blogP2": "Men, women, and children are expected to dress in their finest clothing to perform Eid prayer in a large congregation in an open field. Affluent Muslims who can afford it sacrifice their best halal domestic animals (usually a camel, goat, sheep, or ram depending on the region) as a symbol of Abraham's willingness to sacrifice his only son. The sacrificed animals have to meet certain age and quality standards or else the animal is considered an unacceptable sacrifice.",
      "imageContent":
          "https://imgix.bustle.com/inverse/49/7b/51/ba/9fc0/475d/9786/d6a50426b1cc/aunt-lydia-handmaids-tale.jpeg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg",
      "blogP3": "Therefore, all of us from the MusliMatch team wish you a very happy Eid Mubarak, and enjoy the celebration and feast with someone you know and love. Happy holidays!"
    },
    {
      "blogTitle": "Success Story of Fred Waterford and Serena Joy",
      "imageHeader":
          "https://www.cheatsheet.com/wp-content/uploads/2021/04/Waterfords-Handmaids-Tale-1024x683.jpg",
      "author": "Fabrizio Romano",
      "postDate": "30 June 2022",
      "blogP1": "The Handmaid's Tale certainly makes good on the harrowing image that concluded last week's episode — the effort of Fred and Serena to get Nichole back into Gilead has only escalated since that first PSA. They've even temporarily relocated to Washington, D.C., in order to continue in their mission and bring the Canadians to the table.",
      "blogP2": "Fred is directing more broadcasts to bring international attention to his Nicole effort. Lydia organizes the handmaids in the studio, lining them up while Fred serves as director. June and Serena get a moment alone where the former tries appealing to the latter's sense. “How many more of these videos is he going to do?” June asks. “As many as it takes,” Serena responds.",
      "imageContent":
          "https://4.bp.blogspot.com/-y2R5PJHTRxE/WTg1hknfWKI/AAAAAAAAqos/DEPszVpMi9UMem128ExBN6uNTbe__YrpgCEw/s1600/4n.jpg",
      "blogP3": "It's been a bad few episodes for June and Serena, but here The Handmaid's Tale sets the stage for their ugliest interaction in the show's history. And where better to have this conversation take place than in front of a decapitated Lincoln Memorial?"
    },
    {
      "blogTitle": "Marriage in the 22nd Century",
      "imageHeader":
          "https://imgix.bustle.com/uploads/image/2018/5/1/6d1fda71-dbf9-48b1-9ce1-397489358f17-tht_202_gk_0191rt.jpg?w=970&h=582&fit=crop&crop=faces&auto=format&q=70",
      "author": "Elisabeth Moss",
      "postDate": "28 June 2022",
      "blogP1": "The narrative of The Handmaid's Tale includes two types of marriages, the marriages that are arranged by the regime of Gilead, which is exemplified through the marriage of the Commander and his Wife, and the love-based marriages that existed before the Gilead regime came into power, this type of marriage includes Offred's former marriage to Luke.",
      "blogP2": "By having the Handmaids obtain the names “of” followed by the name of their Commander, it does not only highlight the fact that they are someone's possession, it also connects to the idea of De Beauvoir that women are always compared to men, as a woman “is nothing other than what man decides”. This is further incorporated in The Handmaid's Tale, as the women are either the men's Handmaids or their Wives. Even though the Wives are allowed to keep their own names, unlike the Handmaids, they are still only who they are compared to their husbands.",
      "imageContent":
          "https://imgix.bustle.com/uploads/image/2018/4/17/b8d3007b-4d0d-487c-8cd0-4c13ddd5acf9-handmaidstaleta.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format&q=70",
      "blogP3": "Though Gilead is a dystopia and does not represent an actual Western society, Atwood herself has said that “she would not put anything in the book “that hasn't already been done in some form or another, that isn't happening now or for which we don't have the technology” (as quoted in Howells et all., 97). The Gileadean idea that women are intended or designed to produce children and that marriage is used in order to reassure reproduction comes from reality."
    }
  ]
